// เรียกใช้งานไลบรารี TFT_eSPI สำหรับควบคุมหน้าจอ TFT LCD
#include <TFT_eSPI.h>

// สร้างออบเจ็กต์ชื่อ tft เพื่อใช้สั่งงานหน้าจอ
TFT_eSPI tft;

void setup() {

    // เริ่มต้นการทำงานของหน้าจอ TFT
    tft.begin();

    // กำหนดการหมุนหน้าจอ
    // 0 = แนวตั้ง
    // 1 = แนวนอน (กลับด้าน)
    // 2 = แนวตั้งกลับหัว
    // 3 = แนวนอน
    tft.setRotation(3);

    // เติมสีแดงให้เต็มหน้าจอ
    tft.fillScreen(TFT_RED);
}

void loop() {

    // ไม่มีคำสั่งใน loop()
    // หน้าจอจะแสดงพื้นหลังสีแดงตลอดเวลา

}
